2017/Migration To Dot Net/Port/Baseline/Omiga/Client/WebClientsTest/html/testSubmitAip.htm

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML><HEAD><TITLE>Test Web Service</TITLE>
<META http-equiv=Content-Type content="text/html; charset=windows-1252">
<META content=http://schemas.microsoft.com/intellisense/ie5 
name=vs_targetSchema>
<META content="MSHTML 6.00.2900.2722" name=GENERATOR></HEAD>
<BODY>
<TABLE width="100%">
	<TBODY>
		<TR>
			<TD width="10%">URL</TD>
			<TD width="90%"><INPUT id=url style="WIDTH: 100%" name=url value="http://mars_vm1/OmigaWebServices/test/SubmitAiPWS/OmigaSubmitAiPService.asmx"></TD>
		</TR>
		<TR>
			<TD>SOAP action</TD>
			<TD><INPUT id=soapAction style="WIDTH: 100%" value="http://Request.SubmitAiP.IDUK.Omiga.marlboroughstirling.com"></TD>
		</TR>
	</TBODY>
</TABLE>
Data: 
<TEXTAREA id=requestData style="WIDTH: 100%" rows=12>
<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
<soap:Body>
<REQUEST USERID="JaneD" UNITID="DirUnit1" xmlns="http://Request.SubmitAiP.IDUK.Omiga.marlboroughstirling.com">
		<APPLICATION APPLICATIONNUMBER="10002597" APPLICATIONDATE="22/09/2005" CHANNELID="1">
			<APPLICATIONFACTFIND APPLICATIONFACTFINDNUMBER="1" LANDUSAGE="1" LEVELOFADVICE="20" REGULATIONINDICATOR="10" APPLICATIONNUMBER="10002597" CREDITSCORE="99" CREDITSTATUS="dodgy">
				<CUSTOMERROLE CUSTOMERVERSIONNUMBER="2" APPLICATIONNUMBER="10002597" APPLICATIONFACTFINDNUMBER="1" CUSTOMERNUMBER="100012744" CUSTOMERROLETYPE="1" CUSTOMERORDER="1">
					<CUSTOMER CUSTOMERNUMBER="100012744" OTHERSYSTEMCUSTOMERNUMBER="0000001603" OTHERSYSTEMTYPE="10" CHANNELID="1">
						<CUSTOMERVERSION CUSTOMERVERSIONNUMBER="2" CUSTOMERNUMBER="100012744" FIRSTFORENAME="Frank" SURNAME="Zappa">
							<CUSTOMERADDRESS ADDRESSGUID="F97D1C7A81CC4B1892C174E61B8CD218" CUSTOMERNUMBER="100012744" CUSTOMERVERSIONNUMBER="2" CUSTOMERADDRESSSEQUENCENUMBER="1" ADDRESSTYPE="1" DATEMOVEDIN="09/09/1999" NATUREOFOCCUPANCY="1">
								<ADDRESS ADDRESSGUID="F97D1C7A81CC4B1892C174E61B8CD218" BUILDINGORHOUSENUMBER="101" STREET="London Road" TOWN="Cheltenham" POSTCODE="GL50 1QQ"/>
							</CUSTOMERADDRESS>
							<CUSTOMERTELEPHONENUMBER CUSTOMERNUMBER="100012744" CUSTOMERVERSIONNUMBER="2" TELEPHONESEQUENCENUMBER="1" TELEPHONENUMBER="01234 555667" USAGE="1"/>
							<CUSTOMERTELEPHONENUMBER CUSTOMERNUMBER="100012744" CUSTOMERVERSIONNUMBER="2" TELEPHONESEQUENCENUMBER="2" TELEPHONENUMBER="02222 900222" USAGE="2"/>
							<EMPLOYMENT THIRDPARTYGUID="C3A2BCAB83304C51B71910D0C95D90B6" CUSTOMERNUMBER="100012744" CUSTOMERVERSIONNUMBER="2" EMPLOYMENTSEQUENCENUMBER="1" DATESTARTEDORESTABLISHED="09/09/1969" JOBTITLE="Entertainer">
								<EARNEDINCOME CUSTOMERNUMBER="100012744" CUSTOMERVERSIONNUMBER="2" EMPLOYMENTSEQUENCENUMBER="1" EARNEDINCOMESEQUENCENUMBER="1" EARNEDINCOMEAMOUNT="22000"/>
								<EMPLOYEDDETAILS CUSTOMERNUMBER="100012744" CUSTOMERVERSIONNUMBER="2" EMPLOYMENTSEQUENCENUMBER="1" PAYROLLNUMBER="000003"/>
								<THIRDPARTY ADDRESSGUID="B342EAE4C1B8454FBC426F3FF1AB2419" THIRDPARTYGUID="C3A2BCAB83304C51B71910D0C95D90B6" THIRDPARTYTYPE="10" COMPANYNAME="Zappa Corp.">
									<ADDRESS ADDRESSGUID="B342EAE4C1B8454FBC426F3FF1AB2419" BUILDINGORHOUSENUMBER="2=2" STREET="The Promenade" TOWN="Cheltenham" POSTCODE="GL50 9PP"/>
								</THIRDPARTY>
							</EMPLOYMENT>
						</CUSTOMERVERSION>
					</CUSTOMER>
				</CUSTOMERROLE>
				<APPLICATIONLEGALREP THIRDPARTYGUID="417147D1C92D4D59B3C09880D2692DB8" APPLICATIONNUMBER="10002597" APPLICATIONFACTFINDNUMBER="1" DXID="99" DXLOCATION="somewhere">
					<THIRDPARTY ADDRESSGUID="9FC01B446D71406B8FD3BC2DDAFF4CA0" CONTACTDETAILSGUID="E0A9B560FF724491A9D8C8EB47CBE72B" THIRDPARTYGUID="417147D1C92D4D59B3C09880D2692DB8" THIRDPARTYTYPE="10" COMPANYNAME="Acme Legal Reps Inc.">
						<ADDRESS ADDRESSGUID="9FC01B446D71406B8FD3BC2DDAFF4CA0" BUILDINGORHOUSENUMBER="22" STREET="Lower High Street" TOWN="Cheltenham" POSTCODE="GL50 3WW"/>
						<CONTACTDETAILS CONTACTDETAILSGUID="E0A9B560FF724491A9D8C8EB47CBE72B" CONTACTFORENAME="Joe" CONTACTSURNAME="Acme">
							<CONTACTTELEPHONEDETAILS CONTACTDETAILSGUID="E0A9B560FF724491A9D8C8EB47CBE72B" TELEPHONESEQNUM="1" AREACODE="01242" TELENUMBER="123000"/>
						</CONTACTDETAILS>
					</THIRDPARTY>
				</APPLICATIONLEGALREP>
				<APPLICATIONBANKBUILDINGSOC THIRDPARTYGUID="7D13533B292041FA8A5AF0C4C33B5460" APPLICATIONNUMBER="10002597" APPLICATIONFACTFINDNUMBER="1" BANKACCOUNTSEQUENCENUMBER="1" ACCOUNTNAME="Mr. Francis Zappa Esq." ACCOUNTNUMBER="0000567">
					<THIRDPARTY ADDRESSGUID="57C0AFE0560042F2B85C33B0426E7BC8" CONTACTDETAILSGUID="EE79D409E03E4FF8B4E7DC3C90A7AD8A" THIRDPARTYGUID="7D13533B292041FA8A5AF0C4C33B5460" THIRDPARTYTYPE="3" COMPANYNAME="Honkers $amp; Shaggers.">
						<ADDRESS ADDRESSGUID="57C0AFE0560042F2B85C33B0426E7BC8" BUILDINGORHOUSENUMBER="121" STREET="The Promenade" TOWN="Cheltenham" POSTCODE="GL50 4RR"/>
						<CONTACTDETAILS CONTACTDETAILSGUID="EE79D409E03E4FF8B4E7DC3C90A7AD8A" CONTACTFORENAME="Joe" CONTACTSURNAME="Acme">
							<CONTACTTELEPHONEDETAILS CONTACTDETAILSGUID="EE79D409E03E4FF8B4E7DC3C90A7AD8A" TELEPHONESEQNUM="1" AREACODE="01242" TELENUMBER="123000"/>
						</CONTACTDETAILS>
					</THIRDPARTY>
				</APPLICATIONBANKBUILDINGSOC>
				<FINANCIALSUMMARY APPLICATIONNUMBER="10002597" APPLICATIONFACTFINDNUMBER="1" EXISTINGMORTGAGEINDICATOR="1" TOTALREGULAROUTGOINGS="2200" REGULAROUTGOINGSINDICATOR="1"/>
				<NEWPROPERTY APPLICATIONNUMBER="10002597" APPLICATIONFACTFINDNUMBER="1" APPLICANTTOOCCUPYINDICATOR="1" CURRENTLYOCCUPIEDINDICATOR="1" YEARBUILT="1966">
					<NEWPROPERTYADDRESS ADDRESSGUID="815AC590D2B3447CB67090CF6AC0D58B" APPLICATIONNUMBER="10002597" APPLICATIONFACTFINDNUMBER="1" ACCESSCONTACTNAME="Joe Contact">
						<ADDRESS ADDRESSGUID="815AC590D2B3447CB67090CF6AC0D58B" BUILDINGORHOUSENUMBER="99" STREET="Gloucester Road" TOWN="Cheltenham" POSTCODE="GL50 2XX"/>
					</NEWPROPERTYADDRESS>
					<NEWPROPERTYROOMTYPE APPLICATIONNUMBER="10002597" APPLICATIONFACTFINDNUMBER="1" ROOMTYPE="1" NUMBEROFROOMS="2"/>
					<NEWPROPERTYROOMTYPE APPLICATIONNUMBER="10002597" APPLICATIONFACTFINDNUMBER="1" ROOMTYPE="2" NUMBEROFROOMS="3"/>
				</NEWPROPERTY>
				<OTHERRESIDENT APPLICATIONNUMBER="10002597" APPLICATIONFACTFINDNUMBER="1" OTHERRESIDENTSEQUENCENUMBER="1" PERSONGUID="A77AA8E244FD48F1911BA288641FD240">
					<PERSON PERSONGUID="A77AA8E244FD48F1911BA288641FD240" FIRSTFORENAME="Captain" SURNAME="Beefheart"/>
				</OTHERRESIDENT>
				<QUOTATION QUOTATIONNUMBER="1" APPLICATIONNUMBER="10002597" APPLICATIONFACTFINDNUMBER="1" DISPOSABLEMONTHLYINCOME="2005">
					<MORTGAGESUBQUOTE MORTGAGESUBQUOTENUMBER="1" APPLICATIONNUMBER="10002597" APPLICATIONFACTFINDNUMBER="1" AMOUNTREQUESTED="235000" DEPOSIT="2500" LTV="80.55">
						<LOANCOMPONENT LOANCOMPONENTSEQUENCENUMBER="1" APPLICATIONNUMBER="10002597" APPLICATIONFACTFINDNUMBER="1" MORTGAGESUBQUOTENUMBER="1" MORTGAGEPRODUCTCODE="AL4201" TERMINYEARS="22" TOTALLOANCOMPONENTAMOUNT="99000"/>
						<LOANCOMPONENT LOANCOMPONENTSEQUENCENUMBER="2" APPLICATIONNUMBER="10002597" APPLICATIONFACTFINDNUMBER="1" MORTGAGESUBQUOTENUMBER="1" MORTGAGEPRODUCTCODE="AL4204" TERMINYEARS="22" TOTALLOANCOMPONENTAMOUNT="55000"/>
						<MORTGAGEONEOFFCOST ONEOFFCOSTSEQUENCENUMBER="1" APPLICATIONNUMBER="10002597" APPLICATIONFACTFINDNUMBER="1" MORTGAGESUBQUOTENUMBER="1" MORTGAGEONEOFFCOSTTYPE="5" AMOUNT="51"/>
						<MORTGAGEONEOFFCOST ONEOFFCOSTSEQUENCENUMBER="1" APPLICATIONNUMBER="10002597" APPLICATIONFACTFINDNUMBER="1" MORTGAGESUBQUOTENUMBER="1" MORTGAGEONEOFFCOSTTYPE="10" AMOUNT="101"/>
					</MORTGAGESUBQUOTE>
				</QUOTATION>
			</APPLICATIONFACTFIND>
			<APPLICATIONFEETYPE FEETYPESEQUENCENUMBER="1" FEETYPE="3" APPLICATIONNUMBER="10002597" AMOUNT="129" DESCRIPTION="valuation fee">
				<FEEPAYMENT PAYMENTSEQUENCENUMBER="1" APPLICATIONNUMBER="10002597" FEETYPE="3" FEETYPESEQUENCENUMBER="1" AMOUNTPAID="99" NOTES="yes">
					<PAYMENTRECORD PAYMENTSEQUENCENUMBER="1" APPLICATIONNUMBER="10002597" AMOUNT="99" CHEQUENUMBER="123999"/>
				</FEEPAYMENT>
			</APPLICATIONFEETYPE>
			<APPLICATIONFEETYPE FEETYPESEQUENCENUMBER="2" FEETYPE="3" APPLICATIONNUMBER="10002597" AMOUNT="129" DESCRIPTION="valuation fee">
				<FEEPAYMENT PAYMENTSEQUENCENUMBER="2" APPLICATIONNUMBER="10002597" FEETYPE="3" FEETYPESEQUENCENUMBER="2" AMOUNTPAID="30" NOTES="yes">
					<PAYMENTRECORD PAYMENTSEQUENCENUMBER="2" APPLICATIONNUMBER="10002597" AMOUNT="30" CHEQUENUMBER="345999"/>
				</FEEPAYMENT>
			</APPLICATIONFEETYPE>
			<APPLICATIONFEETYPE FEETYPESEQUENCENUMBER="1" FEETYPE="5" APPLICATIONNUMBER="10002597" AMOUNT="99" DESCRIPTION="administration fee"/>
			<PAYEEHISTORY PAYEEHISTORYSEQNO="1" THIRDPARTYGUID="659FE0C79C4C448C952AC0FDCD57E459" APPLICATIONNUMBER="10002597" BANKSORTCODE="111213" BANKNAME="Egg">
				<THIRDPARTY ADDRESSGUID="AA69CFD25D7D4104AE2CA8F2D77D416B" CONTACTDETAILSGUID="537F1DF249A24EB2B874EBC7F4437C2B" THIRDPARTYGUID="659FE0C79C4C448C952AC0FDCD57E459" THIRDPARTYTYPE="3" COMPANYNAME="egg bank">
					<ADDRESS ADDRESSGUID="AA69CFD25D7D4104AE2CA8F2D77D416B" TOWN="Dudley" POSTCODE="DY99 5TT"/>
					<CONTACTDETAILS CONTACTDETAILSGUID="537F1DF249A24EB2B874EBC7F4437C2B" CONTACTFORENAME="Joe" CONTACTSURNAME="Egg">
						<CONTACTTELEPHONEDETAILS CONTACTDETAILSGUID="537F1DF249A24EB2B874EBC7F4437C2B" TELEPHONESEQNUM="1" AREACODE="09909" TELENUMBER="888000"/>
					</CONTACTDETAILS>
				</THIRDPARTY>
			</PAYEEHISTORY>
			<APPLICATIONSTAGE APPLICATIONNUMBER="10002597" APPLICATIONFACTFINDNUMBER="1" CASESEQUENCENO="1" STAGENUMBER="10" STAGENAME="Customer Registration" DATETIME="03/10/2005" STAGESEQUENCENO="1"/>
			<CASEACTIVITY CASEACTIVITYGUID="6721CA473A3F4955B73411EDE985E97B" CASEID="10002597" SOURCEAPPLICATION="Omiga" ACTIVITYINSTANCE="1" ACTIVITYID="10">
				<CASESTAGE CASEACTIVITYGUID="6721CA473A3F4955B73411EDE985E97B" STAGEID="10" CASESTAGESEQUENCENO="1" STAGEORIGINATINGDATETIME="03/10/2005" STAGEORIGINATINGUNITID="DirUnit1" STAGEORIGINATINGUSERID="JaneD">
					<CASETASK CASEACTIVITYGUID="6721CA473A3F4955B73411EDE985E97B" STAGEID="10" CASESTAGESEQUENCENO="1" TASKID="Complete_Check" TASKINSTANCE="1" CASETASKNAME="Completeness Check" TASKDUEDATEANDTIME="13/10/2005" MANDATORYINDICATOR="0" OWNINGUNITID="DirUnit1" OWNINGUSERID="JaneD" DATEOFOWNERSHIP="03/10/2005" TASKSTATUS="10" TASKSTATUSSETDATETIME="03/10/2005" TASKSTATUSSETBYUSERID="JaneD" TASKSTATUSSETBYUNITID="DirUnit1" ORIGINATINGSTAGEID="10"/>
				</CASESTAGE>
			</CASEACTIVITY>
		</APPLICATION>
</REQUEST>
</soap:Body>
</soap:Envelope>
</TEXTAREA>
<BUTTON id=post style="WIDTH: 100px" type=submit>Test</BUTTON> 
<BR><BR>Response: 
<TEXTAREA id=responseData style="WIDTH: 100%" rows=12></TEXTAREA>
<SCRIPT type=text/javascript>
		<!--
			function post.onclick()
			{
				responseData.innerText = "please wait ...";
				try
				{
					var x = new ActiveXObject("MSXML2.XMLHTTP.3.0");
					x.open("POST", url.value, false);
					x.setRequestHeader("Content-Type", "text/xml; charset=utf-8");
					if (soapAction.value == "")
						soapAction.value = '""';
					x.setRequestHeader("SOAPAction", soapAction.value);
					x.send(requestData.value);
					responseData.value = x.responseText;
				}
				catch (error)
				{
					alert(error.description);
				}
			}
		-->
		</SCRIPT>
 </BODY></HTML>
